espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
/*
 * @brief Set callbacks that will be used to handle encryption negotiation events and authentication events
 * @param [in] callbacks Pointer to BLESecurityCallbacks class callback
 */
void BLEDevice::setSecurityCallbacks(BLESecurityCallbacks *callbacks) {
  BLEDevice::m_securityCallbacks = callbacks;
}

/*
 * @brief Setup local mtu that will be used to negotiate mtu during request from client peer
 * @param [in] mtu Value to set local mtu, should be larger than 23 and lower or equal to 517
 */
esp_err_t BLEDevice::setMTU(uint16_t mtu) {
  log_v(">> setLocalMTU: %d", mtu);

#ifdef CONFIG_BLUEDROID_ENABLED
  esp_err_t err = esp_ble_gatt_set_local_mtu(mtu);
#endif

#if defined(CONFIG_NIMBLE_ENABLED)
  int err = ble_att_set_preferred_mtu(mtu);
#endif

  if (err == ESP_OK) {
    m_localMTU = mtu;
  } else {
    log_e("can't set local mtu value: %d, rc=%d", mtu, err);
  }
  log_v("<< setLocalMTU");
  return err;
}

/*
 * @brief Get local MTU value set during mtu request or default value
 */
uint16_t BLEDevice::getMTU() {
  return m_localMTU;
}

bool BLEDevice::getInitialized() {
  return initialized;
}

/*
 * @brief Get a peer device's Identity Resolving Key (IRK).
 * @param [in] peerAddress The address of the bonded peer device.
 * @param [out] irk Buffer to store the 16-byte IRK.
 * @return True if successful, false otherwise.
 * @note IRK is only available after bonding has occurred.
 */
bool BLEDevice::getPeerIRK(BLEAddress peerAddress, uint8_t *irk) {
  log_v(">> BLEDevice::getPeerIRK()");

  if (irk == nullptr) {
    log_e("IRK buffer is null");
    return false;
  }

#if defined(CONFIG_BLUEDROID_ENABLED)
  // Get the list of bonded devices
  int dev_num = esp_ble_get_bond_device_num();
  if (dev_num == 0) {
    log_e("No bonded devices found");
    return false;
  }

  esp_ble_bond_dev_t *bond_dev = (esp_ble_bond_dev_t *)malloc(sizeof(esp_ble_bond_dev_t) * dev_num);
  if (bond_dev == nullptr) {
    log_e("Failed to allocate memory for bond device list");
    return false;
  }

  esp_err_t ret = esp_ble_get_bond_device_list(&dev_num, bond_dev);
  if (ret != ESP_OK) {
    log_e("Failed to get bond device list: %d", ret);
    free(bond_dev);
    return false;
  }

  // Find the bonded device that matches the peer address
  bool found = false;

  for (int i = 0; i < dev_num; i++) {
    BLEAddress bondAddr(bond_dev[i].bd_addr);
    if (bondAddr.equals(peerAddress)) {
      // Check if the PID key (which contains the IRK) is present
      if (bond_dev[i].bond_key.key_mask & ESP_LE_KEY_PID) {
        memcpy(irk, bond_dev[i].bond_key.pid_key.irk, 16);
        found = true;
        log_d("IRK found for peer: %s", peerAddress.toString().c_str());
        break;
      } else {
        log_w("PID key not present for peer: %s", peerAddress.toString().c_str());
      }
    }
  }

  free(bond_dev);

  if (!found) {
    log_e("IRK not found for peer");
    return false;
  }

  log_v("<< BLEDevice::getPeerIRK()");
  return true;
#endif  // CONFIG_BLUEDROID_ENABLED

#if defined(CONFIG_NIMBLE_ENABLED)
  // Prepare the key structure to search for the peer's security information
  struct ble_store_key_sec key_sec;
  memset(&key_sec, 0, sizeof(key_sec));

  // Convert BLEAddress to ble_addr_t
  // NOTE: BLEAddress stores bytes in INVERSE order for NimBLE,
  // but ble_addr_t.val expects them in normal order, so we reverse them
  ble_addr_t addr;
  uint8_t *peer_addr = peerAddress.getNative();
  for (int i = 0; i < 6; i++) {
    addr.val[i] = peer_addr[5 - i];
  }

  // Try public address first, then random if that fails
  addr.type = BLE_ADDR_PUBLIC;
  memcpy(&key_sec.peer_addr, &addr, sizeof(ble_addr_t));

  // Read the peer's security information from the store
  struct ble_store_value_sec value_sec;
  int rc = ble_store_read_peer_sec(&key_sec, &value_sec);

  // If public address failed, try random address type
  if (rc != 0) {
    addr.type = BLE_ADDR_RANDOM;
    memcpy(&key_sec.peer_addr, &addr, sizeof(ble_addr_t));
    rc = ble_store_read_peer_sec(&key_sec, &value_sec);

    if (rc != 0) {
      log_e("IRK not found for peer: %s", peerAddress.toString().c_str());
      return false;
    }
  }

  // Check if the IRK is present
  if (!value_sec.irk_present) {
    log_e("IRK not present for peer");
    return false;
  }

  // Copy the IRK to the output buffer
  memcpy(irk, value_sec.irk, 16);

  log_d("IRK found for peer: %s (type=%d)", peerAddress.toString().c_str(), addr.type);
  log_v("<< BLEDevice::getPeerIRK()");
  return true;
#endif  // CONFIG_NIMBLE_ENABLED
}

/*
 * @brief Get a peer device's IRK as a comma-separated hex string.
 * @param [in] peerAddress The address of the bonded peer device.
 * @return String in format "0xXX,0xXX,..." or empty string on failure.
 */
String BLEDevice::getPeerIRKString(BLEAddress peerAddress) {
  uint8_t irk[16];
  if (!getPeerIRK(peerAddress, irk)) {
    return String();
  }

  String result = "";
  for (int i = 0; i < 16; i++) {
    result += "0x";
    if (irk[i] < 0x10) {
      result += "0";
    }
    result += String(irk[i], HEX);
    if (i < 15) {
      result += ",";
    }
  }
  return result;
}

/*
 * @brief Get a peer device's IRK as a Base64 encoded string.
 * @param [in] peerAddress The address of the bonded peer device.
 * @return Base64 encoded string or empty string on failure.
 */
String BLEDevice::getPeerIRKBase64(BLEAddress peerAddress) {
  uint8_t irk[16];
  if (!getPeerIRK(peerAddress, irk)) {
    return String();
  }

  return base64::encode(irk, 16);
}

/*
 * @brief Get a peer device's IRK in reverse hex format.
 * @param [in] peerAddress The address of the bonded peer device.
 * @return String in reverse hex format (uppercase) or empty string on failure.
 */
String BLEDevice::getPeerIRKReverse(BLEAddress peerAddress) {
  uint8_t irk[16];
  if (!getPeerIRK(peerAddress, irk)) {
    return String();
  }

  String result = "";
  for (int i = 15; i >= 0; i--) {
    if (irk[i] < 0x10) {
      result += "0";
    }
    result += String(irk[i], HEX);
  }
  result.toUpperCase();
  return result;
}

BLEAdvertising *BLEDevice::getAdvertising() {
  if (m_bleAdvertising == nullptr) {
    m_bleAdvertising = new BLEAdvertising();
    log_i("create advertising");
  }
  log_d("get advertising");
  return m_bleAdvertising;
}

void BLEDevice::startAdvertising() {
  log_v(">> startAdvertising");
  getAdvertising()->start();
  log_v("<< startAdvertising");
}  // startAdvertising

void BLEDevice::stopAdvertising() {
  log_v(">> stopAdvertising");
  getAdvertising()->stop();
  log_v("<< stopAdvertising");
}  // stopAdvertising

/* multi connect support */
/* requires a little more work */
std::map<uint16_t, conn_status_t> BLEDevice::getPeerDevices(bool _client) {
  return m_connectedClientsMap;
}

BLEClient *BLEDevice::getClientByID(uint16_t conn_id) {
  return BLEDevice::getClientByGattIf(conn_id);
}

BLEClient *BLEDevice::getClientByGattIf(uint16_t conn_id) {
  return (BLEClient *)m_connectedClientsMap.find(conn_id)->second.peer_device;
}

BLEClient *BLEDevice::getClientByAddress(BLEAddress address) {
  for (auto &it : m_connectedClientsMap) {
    if (((BLEClient *)it.second.peer_device)->getPeerAddress() == address) {
      return (BLEClient *)it.second.peer_device;
    }
  }
  return nullptr;
}

