espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
void BLEDevice::updatePeerDevice(void *peer, bool _client, uint16_t conn_id) {
  log_d("update conn_id: %d, GATT role: %s", conn_id, _client ? "client" : "server");
  std::map<uint16_t, conn_status_t>::iterator it = m_connectedClientsMap.find(ESP_GATT_IF_NONE);
  if (it != m_connectedClientsMap.end()) {
    std::swap(m_connectedClientsMap[conn_id], it->second);
    m_connectedClientsMap.erase(it);
  } else {
    it = m_connectedClientsMap.find(conn_id);
    if (it != m_connectedClientsMap.end()) {
      conn_status_t _st = it->second;
      _st.peer_device = peer;
      std::swap(m_connectedClientsMap[conn_id], _st);
    }
  }
}

void BLEDevice::addPeerDevice(void *peer, bool _client, uint16_t conn_id) {
  log_i("add conn_id: %d, GATT role: %s", conn_id, _client ? "client" : "server");
  conn_status_t status = {.peer_device = peer, .connected = true, .mtu = 23};

  m_connectedClientsMap.insert(std::pair<uint16_t, conn_status_t>(conn_id, status));
}

//there may have some situation that invoking this function simultaneously, that will cause CORRUPT HEAP
//let this function serializable
portMUX_TYPE BLEDevice::mux = portMUX_INITIALIZER_UNLOCKED;
void BLEDevice::removePeerDevice(uint16_t conn_id, bool _client) {
  portENTER_CRITICAL(&mux);
  log_i("remove: %d, GATT role %s", conn_id, _client ? "client" : "server");
  if (m_connectedClientsMap.find(conn_id) != m_connectedClientsMap.end()) {
    m_connectedClientsMap.erase(conn_id);
  }
  portEXIT_CRITICAL(&mux);
}

/* multi connect support */

/**
 * @brief de-Initialize the %BLE environment.
 * @param release_memory release the internal BT stack memory (prevents reinitialization)
 */
void BLEDevice::deinit(bool release_memory) {
  if (!initialized) {
    return;
  }

  // Stop advertising and scanning first
  if (m_bleAdvertising != nullptr) {
    m_bleAdvertising->stop();
  }

  if (m_pScan != nullptr) {
    m_pScan->stop();
  }

  // Delete all BLE objects
  if (m_bleAdvertising != nullptr) {
    delete m_bleAdvertising;
    m_bleAdvertising = nullptr;
  }

  if (m_pScan != nullptr) {
    delete m_pScan;
    m_pScan = nullptr;
  }

  if (m_pServer != nullptr) {
    delete m_pServer;
    m_pServer = nullptr;
  }

  if (m_pClient != nullptr) {
    delete m_pClient;
    m_pClient = nullptr;
  }

  // Clear the connected clients map
  m_connectedClientsMap.clear();

  // Always deinit the BLE stack
#ifdef CONFIG_BLUEDROID_ENABLED
  esp_bluedroid_disable();
  esp_bluedroid_deinit();
#endif

#if defined(CONFIG_NIMBLE_ENABLED)
  nimble_port_stop();
  nimble_port_deinit();
#endif

#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  hostedDeinitBLE();
#endif

#if CONFIG_BT_CONTROLLER_ENABLED
  esp_bt_controller_disable();
  esp_bt_controller_deinit();
#endif

  // Only release memory if requested (this prevents reinitialization)
  if (release_memory) {
#ifdef ARDUINO_ARCH_ESP32
    // Require tests because we released classic BT memory and this can cause crash (most likely not, esp-idf takes care of it)
#if CONFIG_BT_CONTROLLER_ENABLED
    esp_bt_controller_mem_release(ESP_BT_MODE_BTDM);
#endif
#endif
  }

#ifdef CONFIG_NIMBLE_ENABLED
  m_synced = false;
#endif
  initialized = false;
}

void BLEDevice::setCustomGapHandler(gap_event_handler handler) {
  m_customGapHandler = handler;
#ifdef CONFIG_NIMBLE_ENABLED
  int rc = ble_gap_event_listener_register(&m_listener, handler, NULL);
  if (rc == BLE_HS_EALREADY) {
    log_i("Already listening to GAP events.");
  } else if (rc != 0) {
    log_e("ble_gap_event_listener_register: rc=%d %s", rc, GeneralUtils::errorToString(rc));
  }
#endif
}

BLEStack BLEDevice::getBLEStack() {
#if defined(CONFIG_BLUEDROID_ENABLED)
  return BLEStack::BLUEDROID;
#elif defined(CONFIG_NIMBLE_ENABLED)
  return BLEStack::NIMBLE;
#else
  return BLEStack::UNKNOWN;
#endif
}

String BLEDevice::getBLEStackString() {
  switch (getBLEStack()) {
    case BLEStack::BLUEDROID: return "Bluedroid";
    case BLEStack::NIMBLE:    return "NimBLE";
    case BLEStack::UNKNOWN:
    default:                  return "Unknown";
  }
}

bool BLEDevice::isHostedBLE() {
#if defined(CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE)
  return true;
#else
  return false;
#endif
}

/***************************************************************************
 *                           Bluedroid functions                           *
 ***************************************************************************/

#if defined(CONFIG_BLUEDROID_ENABLED)

/**
 * @brief Handle GATT server events.
 *
 * @param [in] event The event that has been newly received.
 * @param [in] gatts_if The connection to the GATT interface.
 * @param [in] param Parameters for the event.
 */
void BLEDevice::gattServerEventHandler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param) {
  log_d("gattServerEventHandler [esp_gatt_if: %d] ... %s", gatts_if, BLEUtils::gattServerEventTypeToString(event).c_str());

  BLEUtils::dumpGattServerEvent(event, gatts_if, param);

  switch (event) {
    case ESP_GATTS_CONNECT_EVT:
    {
      if (BLESecurity::m_securityEnabled && BLESecurity::m_forceSecurity) {
        BLESecurity::startSecurity(param->connect.remote_bda);
      }
      break;
    }  // ESP_GATTS_CONNECT_EVT

    default:
    {
      break;
    }
  }  // switch

  if (BLEDevice::m_pServer != nullptr) {
    BLEDevice::m_pServer->handleGATTServerEvent(event, gatts_if, param);
  }

  if (m_customGattsHandler != nullptr) {
    m_customGattsHandler(event, gatts_if, param);
  }

}  // gattServerEventHandler

/**
 * @brief Handle GATT client events.
 *
 * Handler for the GATT client events.
 *
 * @param [in] event
 * @param [in] gattc_if
 * @param [in] param
 */
void BLEDevice::gattClientEventHandler(esp_gattc_cb_event_t event, esp_gatt_if_t gattc_if, esp_ble_gattc_cb_param_t *param) {

  log_d("gattClientEventHandler [esp_gatt_if: %d] ... %s", gattc_if, BLEUtils::gattClientEventTypeToString(event).c_str());
  BLEUtils::dumpGattClientEvent(event, gattc_if, param);

  switch (event) {
    case ESP_GATTC_CONNECT_EVT:
    {
      // Set encryption on connect for BlueDroid when security is enabled
      // This ensures security is established before any secure operations
      if (BLESecurity::m_securityEnabled && BLESecurity::m_forceSecurity) {
        BLESecurity::startSecurity(param->connect.remote_bda);
      }
      break;
    }  // ESP_GATTS_CONNECT_EVT

