espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
    default: break;
  }  // switch
  for (auto &myPair : BLEDevice::getPeerDevices(true)) {
    conn_status_t conn_status = (conn_status_t)myPair.second;
    if (((BLEClient *)conn_status.peer_device)->getGattcIf() == gattc_if || ((BLEClient *)conn_status.peer_device)->getGattcIf() == ESP_GATT_IF_NONE
        || gattc_if == ESP_GATT_IF_NONE) {
      ((BLEClient *)conn_status.peer_device)->gattClientEventHandler(event, gattc_if, param);
    }
  }

  if (m_customGattcHandler != nullptr) {
    m_customGattcHandler(event, gattc_if, param);
  }

}  // gattClientEventHandler

/**
 * @brief Handle GAP events.
 */
void BLEDevice::gapEventHandler(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param) {

  BLEUtils::dumpGapEvent(event, param);

  switch (event) {

    case ESP_GAP_BLE_OOB_REQ_EVT:  /* OOB request event */ log_i("ESP_GAP_BLE_OOB_REQ_EVT"); break;
    case ESP_GAP_BLE_LOCAL_IR_EVT: /* BLE local IR event */ log_i("ESP_GAP_BLE_LOCAL_IR_EVT"); break;
    case ESP_GAP_BLE_LOCAL_ER_EVT: /* BLE local ER event */ log_i("ESP_GAP_BLE_LOCAL_ER_EVT"); break;
    case ESP_GAP_BLE_NC_REQ_EVT: /*  NUMERIC CONFIRMATION  */
    {
      log_i("ESP_GAP_BLE_NC_REQ_EVT");
#ifdef CONFIG_BLE_SMP_ENABLE  // Check that BLE SMP (security) is configured in make menuconfig
      if (BLEDevice::m_securityCallbacks != nullptr) {
        esp_ble_confirm_reply(param->ble_security.ble_req.bd_addr, BLEDevice::m_securityCallbacks->onConfirmPIN(param->ble_security.key_notif.passkey));
      } else {
        log_e("onConfirmPIN not implemented. Rejecting connection");
        esp_ble_confirm_reply(param->ble_security.ble_req.bd_addr, false);
      }
#endif  // CONFIG_BLE_SMP_ENABLE
    } break;
    case ESP_GAP_BLE_PASSKEY_REQ_EVT: /* passkey request event */
    {
      log_i("ESP_GAP_BLE_PASSKEY_REQ_EVT: ");
      // esp_log_buffer_hex(m_remote_bda, sizeof(m_remote_bda));
#ifdef CONFIG_BLE_SMP_ENABLE  // Check that BLE SMP (security) is configured in make menuconfig
      uint32_t passkey = BLESecurity::getPassKey();

      if (!BLESecurity::m_passkeySet) {
        if (BLEDevice::m_securityCallbacks != nullptr) {
          log_i("No passkey set, getting passkey from onPassKeyRequest");
          passkey = BLEDevice::m_securityCallbacks->onPassKeyRequest();
        } else {
          log_w("*ATTENTION* onPassKeyRequest not implemented and no static passkey set.");
        }
      }

      if (BLESecurity::m_staticPasskey && passkey == BLE_SM_DEFAULT_PASSKEY) {
        log_w("*ATTENTION* Using default passkey: %06d", BLE_SM_DEFAULT_PASSKEY);
        log_w("*ATTENTION* Please use a random passkey or set a different static passkey");
      } else {
        log_i("Passkey: %d", passkey);
      }

      esp_ble_passkey_reply(param->ble_security.ble_req.bd_addr, true, passkey);
#endif  // CONFIG_BLE_SMP_ENABLE
    } break;
      /*
			 * TODO should we add white/black list comparison?
			 */
    case ESP_GAP_BLE_SEC_REQ_EVT:
    {
      /* send the positive(true) security response to the peer device to accept the security request.
			 If not accept the security request, should sent the security response with negative(false) accept value*/
      log_i("ESP_GAP_BLE_SEC_REQ_EVT");
#ifdef CONFIG_BLE_SMP_ENABLE  // Check that BLE SMP (security) is configured in make menuconfig
      if (BLEDevice::m_securityCallbacks != nullptr) {
        esp_ble_gap_security_rsp(param->ble_security.ble_req.bd_addr, BLEDevice::m_securityCallbacks->onSecurityRequest());
      } else {
        log_w("onSecurityRequest not implemented. Accepting security request");
        esp_ble_gap_security_rsp(param->ble_security.ble_req.bd_addr, true);
      }
#endif  // CONFIG_BLE_SMP_ENABLE
    } break;
      /*
			  *
			  */
    case ESP_GAP_BLE_PASSKEY_NOTIF_EVT:  //the app will receive this evt when the IO  has Output capability and the peer device IO has Input capability.
    {
      //display the passkey number to the user to input it in the peer device within 30 seconds
      log_i("ESP_GAP_BLE_PASSKEY_NOTIF_EVT");
#ifdef CONFIG_BLE_SMP_ENABLE  // Check that BLE SMP (security) is configured in make menuconfig
      uint32_t passkey = param->ble_security.key_notif.passkey;

      if (!BLESecurity::m_passkeySet) {
        log_w("No passkey set");
      }

      if (BLESecurity::m_staticPasskey && passkey == BLE_SM_DEFAULT_PASSKEY) {
        log_w("*ATTENTION* Using default passkey: %06d", BLE_SM_DEFAULT_PASSKEY);
        log_w("*ATTENTION* Please use a random passkey or set a different static passkey");
      } else {
        log_i("Passkey: %d", passkey);
      }

      if (BLEDevice::m_securityCallbacks != nullptr) {
        BLEDevice::m_securityCallbacks->onPassKeyNotify(passkey);
      }
#endif  // CONFIG_BLE_SMP_ENABLE
    } break;
    case ESP_GAP_BLE_KEY_EVT:
    {
      //shows the ble key type info share with peer device to the user.
      log_d("ESP_GAP_BLE_KEY_EVT");
#ifdef CONFIG_BLE_SMP_ENABLE  // Check that BLE SMP (security) is configured in make menuconfig
      log_i("key type = %s", BLESecurity::esp_key_type_to_str(param->ble_security.ble_key.key_type));
#endif  // CONFIG_BLE_SMP_ENABLE
    } break;
    case ESP_GAP_BLE_AUTH_CMPL_EVT:
    {
      log_i("ESP_GAP_BLE_AUTH_CMPL_EVT");
#ifdef CONFIG_BLE_SMP_ENABLE  // Check that BLE SMP (security) is configured in make menuconfig
      // Signal that authentication has completed
      // This unblocks any GATT operations waiting for pairing when bonding is enabled
      BLESecurity::signalAuthenticationComplete();

      if (BLEDevice::m_securityCallbacks != nullptr) {
        BLEDevice::m_securityCallbacks->onAuthenticationComplete(param->ble_security.auth_cmpl);
      }
#endif  // CONFIG_BLE_SMP_ENABLE
    } break;
    default:
    {
      break;
    }
  }  // switch

  if (BLEDevice::m_pClient != nullptr) {
    BLEDevice::m_pClient->handleGAPEvent(event, param);
  }

  if (BLEDevice::m_pScan != nullptr) {
    BLEDevice::getScan()->handleGAPEvent(event, param);
  }

  if (m_bleAdvertising != nullptr) {
    BLEDevice::getAdvertising()->handleGAPEvent(event, param);
  }

  if (m_customGapHandler != nullptr) {
    BLEDevice::m_customGapHandler(event, param);
  }

}  // gapEventHandler
void BLEDevice::setCustomGattcHandler(gattc_event_handler handler) {
  m_customGattcHandler = handler;
}

void BLEDevice::setCustomGattsHandler(gatts_event_handler handler) {
  m_customGattsHandler = handler;
}

#endif

/***************************************************************************
 *                            NimBLE functions                             *
 ***************************************************************************/

