espressif/arduino-esp32/libraries/BLE/src/BLEDevice.cpp
#if defined(CONFIG_NIMBLE_ENABLED)

/**
 * @brief Checks if a peer device is whitelisted.
 * @param [in] address The address to check for in the whitelist.
 * @returns True if the address is in the whitelist.
 */
bool BLEDevice::onWhiteList(BLEAddress &address) {
  for (auto &addr : m_whiteList) {
    if (addr == address) {
      return true;
    }
  }
  return false;
}

void BLEDevice::host_task(void *param) {
  log_i("NimBLE host task started");
  nimble_port_run();  // This function will return only when nimble_port_stop() is executed
  nimble_port_freertos_deinit();
}

void BLEDevice::onReset(int reason) {
  if (!m_synced) {
    return;
  }

  m_synced = false;

  log_i("onReset, reason=%d, %s", reason, BLEUtils::returnCodeToString(reason));

  if (initialized) {
    if (m_pScan != nullptr) {
      m_pScan->onHostReset();
    }
  }
}

void BLEDevice::onSync() {
  log_d("onSync");

  if (m_synced) {
    log_d("onSync: already synced");
    return;
  }

  int rc = ble_hs_util_ensure_addr(0);
  if (rc == 0) {
    rc = ble_hs_util_ensure_addr(1);
  }

  if (rc != 0) {
    log_e("onSync: failed to ensure BLE address. rc=%d", rc);
    return;
  }

  rc = ble_hs_id_copy_addr(BLE_OWN_ADDR_PUBLIC, NULL, NULL);
  if (rc != 0) {
    log_d("onSync: no public address available");
    m_ownAddrType = BLE_OWN_ADDR_RANDOM;
  }

  // Yield for housekeeping tasks before returning to operations.
  // Occasionally triggers exception without.
  ble_npl_time_delay(1);

  m_synced = true;

  if (initialized) {
    if (m_pScan != nullptr) {
      m_pScan->onHostSync();
    }
    if (m_bleAdvertising != nullptr) {
      m_bleAdvertising->onHostSync();
    }
  }
}

void BLEDevice::setDeviceCallbacks(BLEDeviceCallbacks *cb) {
  if (cb == nullptr) {
    m_pDeviceCallbacks = &defaultDeviceCallbacks;
  } else {
    m_pDeviceCallbacks = cb;
  }
}

/**
 * @brief Sets the address type to use.
 * @param [in] type Bluetooth Device address type.
 * The available types are defined as:
 * * 0x00: BLE_OWN_ADDR_PUBLIC - Public address; Uses the hardware static address.
 * * 0x01: BLE_OWN_ADDR_RANDOM - Random static address; Uses the hardware or generated random static address.
 * * 0x02: BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT - Resolvable private address, defaults to public if no RPA available.
 * * 0x03: BLE_OWN_ADDR_RPA_RANDOM_DEFAULT - Resolvable private address, defaults to random static if no RPA available.
 */
bool BLEDevice::setOwnAddrType(uint8_t type) {
  int rc = ble_hs_id_copy_addr(type & 1, NULL, NULL);  // Odd values are random
  if (rc != 0) {
    log_e("Unable to set address type %d, rc=%d", type, rc);
    return false;
  }

  m_ownAddrType = type;

  if (type == BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT || type == BLE_OWN_ADDR_RPA_RANDOM_DEFAULT) {
#ifdef CONFIG_IDF_TARGET_ESP32
    // esp32 controller does not support RPA so we must use the random static for calls to the stack
    // the host will take care of the random private address generation/setting.
    m_ownAddrType = BLE_OWN_ADDR_RANDOM;
    rc = ble_hs_pvcy_rpa_config(NIMBLE_HOST_ENABLE_RPA);
#endif
  } else {
#ifdef CONFIG_IDF_TARGET_ESP32
    rc = ble_hs_pvcy_rpa_config(NIMBLE_HOST_DISABLE_PRIVACY);
#endif
  }
  return rc == 0;
}  // setOwnAddrType

/**
 * @brief Set the device address to use.
 * @param [in] addr The address to set.
 * @return True if the address was set successfully.
 * @details To use the address generated the address type must be set to random with `setOwnAddrType`.
 */
bool BLEDevice::setOwnAddr(BLEAddress &addr) {
  return setOwnAddr(addr.getNative());
}  // setOwnAddr

/**
 * @brief Set the device address to use.
 * @param [in] addr The address to set.
 * @return True if the address was set successfully.
 * @details To use the address generated the address type must be set to random with `setOwnAddrType`.
 */
bool BLEDevice::setOwnAddr(uint8_t *addr) {
  int rc = ble_hs_id_set_rnd(addr);
  if (rc != 0) {
    log_e("Failed to set address, rc=%d", rc);
    return false;
  }
  return true;
}  // setOwnAddr

int BLEDeviceCallbacks::onStoreStatus(struct ble_store_status_event *event, void *arg) {
  log_d("onStoreStatus: default");
  return ble_store_util_status_rr(event, arg);
}

#endif

#endif /* CONFIG_BLUEDROID_ENABLED || CONFIG_NIMBLE_ENABLED */
#endif /* SOC_BLE_SUPPORTED || CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE */
